Тестовая_база_ERP_14/src/Catalogs/CRM_УсловияСрабатыванияТриггеров/CRM_УсловияСрабатыванияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УсловияСрабатыванияТриггеров</name>
  <predefined>
    <items>
      <name>ПоРасписанию</name>
      <description>По расписанию</description>
    </items>
    <items>
      <name>ПисьмоОтНовогоКлиента</name>
      <description>Получено письмо от нового клиента</description>
    </items>
    <items>
      <name>ВходящийТелефонныйЗвонокПоИнтересуКлиента</name>
      <description>При входящем звонке (по интересу)</description>
    </items>
    <items>
      <name>ВходящееЭлектронноеПисьмоПоИнтересуКлиента</name>
      <description>При входящем письме (по интересу)</description>
    </items>
    <items>
      <name>ВходящееСообщениеЧатаПоИнтересуКлиента</name>
      <description>При входящем сообщение чата (по интересу)</description>
    </items>
    <items>
      <name>ПроверкаСвязиСИнтересом</name>
      <description>При записи входящего электронного письма  (проверка связи с  Интересом клиента)</description>
    </items>
    <items>
      <name>ПриОплатеПоИнтересу</name>
      <description>При оплате (по интересу)</description>
    </items>
    <items>
      <name>ПриОтгрузкеПоИнтересу</name>
      <description>При отгрузке (по интересу)</description>
    </items>
    <items>
      <name>ПриВыбореНовогоСостоянияИнтереса</name>
      <description>При переходе в состояние интереса</description>
    </items>
    <items>
      <name>ПриИзмененииТекущегоСостоянияИнтереса</name>
      <description>При смене текущего состояния интереса</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользоватьСКД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСтандартнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаПроверки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектДействия</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбъектОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбъектОбработкиПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьПоПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКОбработке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>EnumRef.CRM_СобытияТриггеров</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыОбработки</name>
    <attributes>
      <name>ОбъектОбработки</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/CRM_СобытияТриггеров/CRM_СобытияТриггеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СобытияТриггеров</name>
  <enumValues>
    <name>ПриЗаписи</name>
  </enumValues>
  <enumValues>
    <name>ПередЗаписью</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПроведения</name>
  </enumValues>
  <enumValues>
    <name>ВыполнитьПереопределяемуюКоманду</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОповещения</name>
  </enumValues>
  <enumValues>
    <name>ПередЗаписьюНаСервере</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервере</name>
  </enumValues>
  <enumValues>
    <name>ПослеЗаписиНаСервере</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйОрдерНаТовары</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтбору</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <attributes>
    <name>ВсегоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПоЗаданиюНаПеревозку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПросмотраПоТоварам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРасходныхОрдеров</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>АГ_Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>АГ_КоличествоМетров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АГ_КоличествоШт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Catalogs/CRM_УсловияСрабатыванияТриггеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Шаблоны схемы компоновки данных
// 
// Возвращаемое значение:
//  Шаблоны - Массив - Массив шаблонов ключевых показателей.
//
Функция ШаблоныСхемыКомпоновкиДанных() Экспорт
	
	Шаблоны = Новый Массив;
	
	Для каждого Макет из Метаданные.Справочники.CRM_ШаблоныКлючевыхПоказателей.Макеты Цикл
		
		Если Макет.ТипМакета <> Метаданные.СвойстваОбъектов.ТипМакета.СхемаКомпоновкиДанных Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Шаблоны.Добавить(Новый Структура("Имя, Синоним", Макет.Имя, Макет.Синоним));
		
	КонецЦикла;
	
	Возврат Шаблоны;
	
КонецФункции

// Процедура - Создать предопределенные действия
//  Процедура создает предопределенные действия.
//
Процедура СоздатьПредопределенныеДействия(Параметры = Неопределено) Экспорт
	
	ИдентификаторМетаданныхИнтерес = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Документы.CRM_Интерес);
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ПроверкаСвязиСИнтересом.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПроверкаСвязиСИнтересом"));
	ОбработкаТриггера.НазваниеОбработки = "ПроверкаСвязиСИнтересом";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ПисьмоОтНовогоКлиента.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПисьмоОтНовогоКлиента"));
	ОбработкаТриггера.НазваниеОбработки = "ПисьмоОтНовогоКлиента";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ПриВыбореНовогоСостоянияИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПриВыбореНовогоСостоянияИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ПриВыбореНовогоСостоянияИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_Интерес"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ПриИзмененииТекущегоСостоянияИнтереса.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПриИзмененииТекущегоСостоянияИнтереса"));
	ОбработкаТриггера.НазваниеОбработки = "ПриИзмененииТекущегоСостоянияИнтереса";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_Интерес"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ВходящееСообщениеЧатаПоИнтересуКлиента.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПроверкаСвязиСИнтересом"));
	ОбработкаТриггера.НазваниеОбработки = "ПроверкаСвязиСИнтересом";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.CRM_СообщениеМессенджера"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ВходящееЭлектронноеПисьмоПоИнтересуКлиента.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПроверкаСвязиСИнтересом"));
	ОбработкаТриггера.НазваниеОбработки = "ПроверкаСвязиСИнтересом";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ВходящийТелефонныйЗвонокПоИнтересуКлиента.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(Справочники.CRM_УсловияСрабатыванияТриггеров.ПолучитьМакет("ПроверкаСвязиСИнтересом"));
	ОбработкаТриггера.НазваниеОбработки = "ПроверкаСвязиСИнтересом";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ПриЗаписи;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
		НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ТелефонныйЗвонок"));
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ПриОплатеПоИнтересу.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ПриОплатеПоИнтересу"));
	ОбработкаТриггера.НазваниеОбработки = "ПриОплатеПоИнтересу";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ОбработкаПроведения;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.CRM_ДокументРасчетовСКонтрагентом");
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.CRM_СчетНаОплатуПокупателю");
		Иначе
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ПоступлениеБезналичныхДенежныхСредств");
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ПриходныйКассовыйОрдер");
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ОперацияПоПлатежнойКарте");
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
	ОбработкаТриггера = Справочники.CRM_УсловияСрабатыванияТриггеров.ПриОтгрузкеПоИнтересу.ПолучитьОбъект();
	ОбработкаТриггера.ОбработкаПроверки = Новый ХранилищеЗначения(ПолучитьМакет(?(CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM(),"","CRM_Модуль_")+"ПриОтгрузкеПоИнтересу"));
	ОбработкаТриггера.НазваниеОбработки = "ПриОтгрузкеПоИнтересу";
	ОбработкаТриггера.ИспользуетсяСтандартнаяОбработка = Истина;
	ОбработкаТриггера.Событие = Перечисления.CRM_СобытияТриггеров.ОбработкаПроведения;
	ОбработкаТриггера.ОткрыватьПоПути = Ложь;
	ОбработкаТриггера.ИспользоватьСКД = Ложь;
	ОбработкаТриггера.РежимОтладки = Ложь;
	ОбработкаТриггера.ОбъектДействия = ИдентификаторМетаданныхИнтерес;
	
	Если ОбработкаТриггера.ОбъектыОбработки.Количество() = 0 Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.CRM_СчетНаОплатуПокупателю");
		Иначе
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.РеализацияТоваровУслуг");
			НовыйОбъект = ОбработкаТриггера.ОбъектыОбработки.Добавить();
			НовыйОбъект.ОбъектОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.РасходныйОрдерНаТовары");
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаТриггера.Записать();
	
КонецПроцедуры

// Функция - Массив исключаемых по функциональным опциям предопределенных элементов справочника.
// 
// Возвращаемое значение:
//  МассивИсключаемых - Массив - Массив ссылок.
//
Функция МассивИсключаемыхПоФОПредопределенных() Экспорт
	
	МассивИсключаемых = Новый Массив;
	
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОбъектДействия) И НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(
				ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Выборка.ОбъектДействия)) Тогда
			МассивИсключаемых.Добавить(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		Если Выборка.ОбъектыОбработки.Количество() > 0 Тогда
			Исключить = Истина;
			Для каждого ОбъектОбработки из Выборка.ОбъектыОбработки Цикл
				Если ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(
					ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ОбъектОбработки.ОбъектОбработки)) Тогда
					Исключить = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			Если Исключить Тогда
				МассивИсключаемых.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивИсключаемых;
	
КонецФункции

Процедура ЗаполнитьТЧОбъектыОбработкиПриОбновлении(Параметры = Неопределено) Экспорт
	
	Выборка = Справочники.CRM_УсловияСрабатыванияТриггеров.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОбъектыОбработки.Количество() = 0 И ЗначениеЗаполнено(Выборка.УдалитьТипОбъекта) И ЗначениеЗаполнено(Выборка.УдалитьОбъектОбработки) Тогда
			ИдентификаторОбъектаОбработки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
												ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
												СтрЗаменить(Выборка.УдалитьТипОбъекта, "-", "")+"."+Выборка.УдалитьОбъектОбработки).ПустаяСсылка()));
			УсловиеОбъект = Выборка.ПолучитьОбъект();
			НовСтр = УсловиеОбъект.ОбъектыОбработки.Добавить();
			НовСтр.ОбъектОбработки = ИдентификаторОбъектаОбработки;
			УсловиеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ОбъектДействия") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	CRM_УсловияСрабатыванияТриггеров.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.CRM_УсловияСрабатыванияТриггеров КАК CRM_УсловияСрабатыванияТриггеров
		                      |ГДЕ
		                      |	(CRM_УсловияСрабатыванияТриггеров.ОбъектОбработки = &ОбъектОбработки
		                      |			ИЛИ CRM_УсловияСрабатыванияТриггеров.ОбъектДействия = &ОбъектДействия)
		                      |	И CRM_УсловияСрабатыванияТриггеров.Наименование ПОДОБНО &Наименование
		                      |	И НЕ CRM_УсловияСрабатыванияТриггеров.ПометкаУдаления");
		Запрос.УстановитьПараметр("ОбъектДействия", Параметры.Отбор.ОбъектДействия);
		Запрос.УстановитьПараметр("ОбъектОбработки", Параметры.Отбор.ОбъектДействия.Имя);
		Запрос.УстановитьПараметр("Наименование", "%"+Параметры.СтрокаПоиска+"%");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
